In [2]:
import pandas as pd
import sqlite3
conn=sqlite3.connect('/content/drive/MyDrive/3_SQL/Db-IMDB-Assignment.db')

In [3]:
table=pd.read_sql_query("SELECT NAME as 'Table_Name' FROM sqlite_master WHERE type='table'",conn)
tables = table["Table_Name"].values.tolist()
print(tables)

['Movie', 'Genre', 'Language', 'Country', 'Location', 'M_Location', 'M_Country', 'M_Language', 'M_Genre', 'Person', 'M_Producer', 'M_Director', 'M_Cast']

In [4]:
for table in tables:
    query = "PRAGMA TABLE_INFO({})".format(table)
    schema = pd.read_sql_query(query,conn)
    print("Schema of",table)
    display(schema)
    print("-"*100)
    print("\n")

Schema of Movie

   cid       name     type  notnull dflt_value  pk
0    0      index  INTEGER        0       None   0
1    1        MID     TEXT        0       None   0
2    2      title     TEXT        0       None   0
3    3       year     TEXT        0       None   0
4    4     rating     REAL        0       None   0
5    5  num_votes  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    CID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    LID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    LID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    CID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Person

   cid    name     type  notnull dflt_value  pk
0    0   index  INTEGER        0       None   0
1    1     PID     TEXT        0       None   0
2    2    Name     TEXT        0       None   0
3    3  Gender     TEXT        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Producer

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Director

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Cast

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------

####Q1.List all the directors who directed a 'Comedy' movie in a leap year. (You need to check that the genre is 'Comedyâ€™ and year is a leap year) Your query should return director name, the movie name, and the year.

In [5]:
query="""SELECT Name,title,year FROM (SELECT * FROM Person JOIN M_Director ON Person.PID=M_Director.PID JOIN Movie ON Movie.MID=M_Director.MID) WHERE RTRIM(MID) IN (SELECT MID FROM (SELECT * FROM M_Genre JOIN Genre ON M_Genre.GID=Genre.GID ) WHERE RTRIM(Name) ='Comedy') AND (year%4==0 AND (year%100!=0))"""
df=pd.read_sql_query(query,conn)
print(df)

                      Name                             title  year
0             Milap Zaveri                        Mastizaade  2016
1             Umesh Ghadge              Kyaa Kool Hain Hum 3  2016
2            Sameer Sharma      Luv Shuv Tey Chicken Khurana  2012
3           Sanjeev Sharma                     Saat Uchakkey  2016
4             Nitin Kakkar                        Filmistaan  2012
5        Krishnadev Yagnik                    Days of Tafree  2016
6          Abhishek Sharma     Tere Bin Laden: Dead Or Alive  2016
7             Mahesh Bhatt                   Papa Kahte Hain  1996
8             Sachin Yardi          Kyaa Super Kool Hain Hum  2012
9                   Sachin              Navra Mazha Navsacha  2004
10            Kawal Sharma                         Maalamaal  1988
11             Aditya Datt                 Will You Marry Me  2012
12          Rajnish Thakur  Mere Dost Picture Abhi Baaki Hai  2012
13            Karan Razdan               Mr Bhatti on Chutti  2012
14      Jagdish Rajpurohit                            Bumboo  2012
15             Suhas Kadav         Motu Patlu: King of Kings  2016
16        Vickrant Mahajan                     Challo Driver  2012
17               Bhagyaraj                       Mr. Bechara  1996
18            Rakesh Mehta              Life Ki Toh Lag Gayi  2012
19            Anand Balraj          Daal Mein Kuch Kaala Hai  2012
20            Govind Menon                 Kis Kis Ki Kismat  2004
21         Pankaj Parashar                    Ab Ayega Mazaa  1984
22            Jabbar Patel                  Ek Hota Vidushak  1992
23       Srinivas Bhashyam                      Paisa Vasool  2004
24             Raj Kaushal                  Shaadi Ka Laddoo  2004
25   Siddharth Anand Kumar                       Let's Enjoy  2004

####Q2:List the names of all the actors who played in the movie 'Anand' (1971)

In [6]:
aq="""SELECT Name FROM Person WHERE PID IN 
            (SELECT LTRIM(PID) FROM M_Cast WHERE MID IN 
                   (SELECT MID FROM Movie WHERE title== 'Anand')
            )"""
df23=pd.read_sql_query(aq,conn)
print(df23)

                 Name
0    Amitabh Bachchan
1       Rajesh Khanna
2       Sumita Sanyal
3          Ramesh Deo
4           Seema Deo
5      Asit Kumar Sen
6          Dev Kishan
7        Atam Prakash
8       Lalita Kumari
9              Savita
10     Brahm Bhardwaj
11       Gurnam Singh
12       Lalita Pawar
13        Durga Khote
14         Dara Singh
15      Johnny Walker
16          Moolchand

####Q3.List all the actors who acted in a film before 1970 and in a film after 1990.

In [7]:
q=""" select * from (Select DISTINCT(p.Name) from Person p 
      JOIN M_cast mc ON (p.PID)=TRIM(mc.PID)
      JOIN Movie m ON (m.MID)=TRIM(mc.MID)
      WHERE CAST(SUBSTR(TRIM(m.year),-4) AS Integer)<1970) before
      JOIN
      (Select DISTINCT (p.Name) from Person p 
      JOIN M_cast mc ON (p.PID)=TRIM(mc.PID)
      JOIN Movie m ON (m.MID)=TRIM(mc.MID)
      WHERE CAST(SUBSTR(TRIM(m.year),-4) AS Integer)>1990) after
      ON (before.Name)=(after.Name)"""
df=pd.read_sql_query(q,conn)
print(df)

                Name             Name
0     Waheeda Rehman   Waheeda Rehman
1      Johnny Walker    Johnny Walker
2              Veena            Veena
3            Nilofer          Nilofer
4            Mehmood          Mehmood
..               ...              ...
419           Sunita           Sunita
420         Rajkumar         Rajkumar
421          Lakshmi          Lakshmi
422            Rekha            Rekha
423            Iqbal            Iqbal

[424 rows x 2 columns]

In [8]:
q=""" Select p.Name from Person p 
      JOIN M_cast mc ON (p.PID)=TRIM(mc.PID)
      JOIN Movie m ON (m.MID)=TRIM(mc.MID)
      WHERE CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)>1990"""
df=pd.read_sql_query(q,conn)
print(df)
q=""" Select p.Name from Person p 
      JOIN M_cast mc ON (p.PID)=TRIM(mc.PID)
      JOIN Movie m ON (m.MID)=TRIM(mc.MID)
      WHERE CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)<1970"""
df=pd.read_sql_query(q,conn)
print(df)

                        Name
0             Christian Bale
1             Cate Blanchett
2       Benedict Cumberbatch
3              Naomie Harris
4                Andy Serkis
...                      ...
62565           Yunus Parvez
62566           Johnny Lever
62567             Ishrat Ali
62568           Sudhir Dalvi
62569          Bharat Kapoor

[62570 rows x 1 columns]
                 Name
0      Michael Rennie
1       Patricia Neal
2        Hugh Marlowe
3           Sam Jaffe
4          Billy Gray
...               ...
4937         Rajkumar
4938   Sabitha Perara
4939          Lakshmi
4940            Rekha
4941            Iqbal

[4942 rows x 1 columns]

####Q4.List all directors who directed 10 movies or more, in descending order of the number of movies they directed. Return the directors' names and the number of movies each of them directed.

In [ ]:
aq="""SELECT Name,COUNT(MID) movie_count FROM ( SELECT * FROM Person m JOIN M_Director g ON m.PID=G.PID) GROUP BY PID HAVING movie_count>=10 ORDER BY movie_count DESC"""
df23=pd.read_sql_query(aq,conn)
print(df23)

                         Name  movie_count
0                David Dhawan           39
1                Mahesh Bhatt           35
2                Priyadarshan           30
3             Ram Gopal Varma           30
4                Vikram Bhatt           29
5        Hrishikesh Mukherjee           27
6                 Yash Chopra           21
7             Basu Chatterjee           19
8              Shakti Samanta           19
9                Subhash Ghai           18
10              Shyam Benegal           17
11   Abbas Alibhai Burmawalla           17
12          Rama Rao Tatineni           17
13             Manmohan Desai           16
14                     Gulzar           16
15               Raj N. Sippy           16
16                 Raj Kanwar           15
17           Mahesh Manjrekar           15
18                Indra Kumar           14
19                 Raj Khosla           14
20               Rahul Rawail           14
21          Rajkumar Santoshi           14
22              Rakesh Roshan           13
23                  Dev Anand           13
24                Vijay Anand           13
25               Harry Baweja           13
26             Anurag Kashyap           13
27   Ananth Narayan Mahadevan           13
28         K. Raghavendra Rao           13
29               Anees Bazmee           12
30               Guddu Dhanoa           12
31                Prakash Jha           12
32             Satish Kaushik           12
33            Nagesh Kukunoor           12
34              Prakash Mehra           12
35                Umesh Mehra           12
36                Anil Sharma           12
37          Madhur Bhandarkar           12
38               Rohit Shetty           12
39         Pramod Chakravorty           11
40               Sanjay Gupta           11
41              Nasir Hussain           11
42                Ketan Mehta           11
43            Govind Nihalani           11
44                 Mohit Suri           11
45                 Raj Kapoor           10
46                 K. Bapaiah           10
47            Vishal Bhardwaj           10
48                 N. Chandra           10
49           Tigmanshu Dhulia           10
50                 J.P. Dutta           10
51                Mehul Kumar           10
52               Hansal Mehta           10
53              Sudhir Mishra           10
54        K. Muralimohana Rao           10
55            Pankaj Parashar           10
56              J. Om Prakash           10
57                  Bimal Roy           10

####5.A) For each year, count the number of movies in that year that had only female actors.

In [14]:
q="""SELECT  CAST(SUBSTR(m.year,-4) AS Integer) year,COUNT(m.MID) movie_only_female_character
        FROM Movie m
        JOIN
        (SELECT DISTINCT MID FROM M_Cast WHERE MID NOT IN
        (SELECT MID FROM M_Cast MC  
         JOIN Person p ON p.PID=TRIM(MC.PID)
         WHERE TRIM(p.Gender)='Male')) fem
        ON Fem.MID=m.MID
        GROUP BY CAST(SUBSTR(m.year,-4) AS Integer)
        """
df=pd.read_sql_query(q,conn)
print(df)

   year  movie_only_female_character
0  1939                            1
1  1999                            1
2  2000                            1
3  2018                            1

####5 B) Now include a small change: report for each year the percentage of movies in that year with only female actors, and the total number of movies made that year. For example, one answer will be: 1990 31.81 13522 meaning that in 1990 there were 13,522 movies, and 31.81% had only female actors.

In [45]:
q="""SELECT tm.year,total_movie,movie_only_female_character, CAST(movie_only_female_character AS Float)/CAST(total_movie AS Float) PERCENTAGE
    FROM 
      (SELECT  CAST(SUBSTR(m.year,-4) AS Integer) year,COUNT(m.MID) movie_only_female_character
        FROM Movie m
        JOIN
        (SELECT DISTINCT MID FROM M_Cast WHERE MID NOT IN
        (SELECT MID FROM M_Cast MC  
         JOIN Person p ON p.PID=TRIM(MC.PID)
         WHERE TRIM(p.Gender)='Male')) fem
        ON Fem.MID=m.MID
        GROUP BY CAST(SUBSTR(m.year,-4) AS Integer)) female
        JOIN 
        (SELECT year,COUNT(MID) total_movie FROM Movie GROUP BY year ) tm
        ON female.year=tm.year"""
df=pd.read_sql_query(q,conn)
print(df)

   year  total_movie  movie_only_female_character  PERCENTAGE
0  1939            2                            1    0.500000
1  1999           66                            1    0.015152
2  2000           64                            1    0.015625
3  2018           93                            1    0.010753

####6.Find the film(s) with the largest cast. Return the movie title and the size of the cast. By "cast  size" we mean the number of distinct actors that played in that movie: if an actor played multiple roles, or if it simply occurs multiple times in casts, we still count her/him only once.

In [ ]:
q="""SELECT title,MAX(cast_size) FROM (SELECT title, COUNT(PID) cast_size FROM (SELECT * FROM M_Cast JOIN Movie ON M_Cast.MID=Movie.MID) GROUP BY title ORDER BY cast_size DESC)"""
df=pd.read_sql_query(q,conn)
print(df)

           title  MAX(cast_size)
0  Ocean's Eight             238

####7. A decade is a sequence of 10 consecutive years. For example, say in your database you have movie information starting from 1965. Then the first decade is 1965, 1966, ..., 1974; the second one is 1967, 1968, ..., 1976 and so on. Find the decade D with the largest number of films and the total number of films in D.

In [5]:
q="""select y.year as decade_start, y.year + 9 as decade_end,
       count(*) as num_movies
       from (select distinct year from Movie) y join
     Movie m
     on m.year >= y.year and m.year < y.year + 10
group by CAST(SUBSTR(y.year,-4) AS Integer)
order by count(*) desc
limit 1;"""
df=pd.read_sql_query(q,conn)
print(df)

  decade_start  decade_end  num_movies
0         2008        2017        1126

####8.Find all the actors that made more movies with Yash Chopra than any other director.

In [48]:
q=""" SELECT * FROM (SELECT pc.Name, COUNT(DISTINCT md.MID) YASH_CHOPRA_Directed FROM Movie m
      JOIN M_Director md ON md.MID=m.MID
      JOIN M_cast mc ON (m.MID)=TRIM(mc.MID)
      JOIN Person pd ON pd.PID=TRIM(md.PID)
      JOIN Person pc on pc.PID=TRIM(mc.PID)
      WHERE TRIM(pd.Name)='Yash Chopra'
      GROUP BY pc.Name) dirY
      JOIN 
      (SELECT pc.Name, COUNT(DISTINCT md.MID) Non_yash_chopra_Movie FROM Movie m
      JOIN M_Director md ON md.MID=m.MID
      JOIN M_cast mc ON (m.MID)=TRIM(mc.MID)
      JOIN Person pd ON pd.PID=TRIM(md.PID)
      JOIN Person pc on pc.PID=TRIM(mc.PID)
      WHERE TRIM(pd.Name)!='Yash Chopra'
      GROUP BY pc.Name) other
      ON (dirY.Name)=(other.Name)
      WHERE (dirY.YASH_CHOPRA_Directed  > other.Non_yash_chopra_Movie)"""
df=pd.read_sql_query(q,conn)
print(df)

           Name  YASH_CHOPRA_Directed          Name  Non_yash_chopra_Movie
0   Ashok Verma                     2   Ashok Verma                      1
1         Nazir                     2         Nazir                      1
2   Yash Chopra                     2   Yash Chopra                      1

####10.The Shahrukh number of an actor is the length of the shortest path between the actor and Shahrukh Khan in the "co-acting" graph. That is, Shahrukh Khan has Shahrukh number 0; all actors who acted in the same film as Shahrukh have Shahrukh number 1; all actors who acted in the same film as some actor with Shahrukh number 1 have Shahrukh number 2, etc. Return all actors whose Shahrukh number is 2.

In [ ]:
q="""WITH 
    SHAHRUKH_0 AS
    (
        SELECT
            TRIM(P.PID) PID
        FROM
            Person P
        WHERE
            Trim(P.Name) like '%Shahrukh%'
    ),
    SHAHRUKH_1_MOVIES AS
    (
        SELECT
            DISTINCT
            TRIM(MC.MID) MID,
            S0.PID
        FROM
            M_Cast MC,
            SHAHRUKH_0 S0
        WHERE
            TRIM(MC.PID) = S0.PID
    ),
    SHAHRUKH_1_ACTORS AS
    (
        SELECT
            DISTINCT
            TRIM(MC.PID) PID
        FROM
            M_Cast MC,
            SHAHRUKH_1_MOVIES S1M
        WHERE
            TRIM(MC.MID) = S1M.MID AND
            TRIM(MC.PID) <> S1M.PID
    ),
    SHAHRUKH_2_MOVIES AS
    (
        SELECT
            DISTINCT
            TRIM(MC.MID) MID,
            S1A.PID
        FROM
            M_Cast MC,
            SHAHRUKH_1_ACTORS S1A
        WHERE
            TRIM(MC.PID) = S1A.PID
    )
    SELECT
        DISTINCT
        TRIM(MC.PID) PID,
        TRIM(P.Name) ACTOR_NAME
    FROM
        Person P,
        M_Cast MC,
        SHAHRUKH_2_MOVIES S2M
    WHERE
            TRIM(MC.PID) = TRIM(P.PID) AND
            TRIM(MC.MID) = S2M.MID AND
            TRIM(MC.PID) <> S2M.PID;"""
df=pd.read_sql_query(q,conn)
print(df)

             PID             ACTOR_NAME
0      nm2951768           Freida Pinto
1      nm6467532  Caroline Christl Long
2      nm6071249          Rajeev Pahuja
3      nm3491108      Michelle Santiago
4      nm7509518         Jandre le Roux
...          ...                    ...
15906  nm3099317           Dhruv Shetty
15907  nm2371614        Hayley Cleghorn
15908  nm2675737        Nirvasha Jithoo
15909  nm2370589         Kamal Maharshi
15910  nm1866356           Mohini Manik

[15911 rows x 2 columns]